export const errorReason = {
    '-9797': '서버 점검 중',
    '-999': '클라이언트 버전이 너무 낮음',
    '-998': '인증이 필요함',
    '-997': '계정이 차단됨',
    '-500': '알 수 없는 실패',
    '-402': '차단된 친구에게 메시지 전송 시도',
    '-401': '채팅을 찾을 수 없음',
    '-301': 'INTERNAL_SERVER_ERROR_BO',
    '-300': 'INTERNAL_SERVER_ERROR_CARRIAGE',
    '-203': '올바르지 않은 Parameter',
    '-202': '올바르지 않은 Method',
    '-201': '로그아웃된 계정으로부터 요청 발생',
    '-112': '인증을 너무 많이 요청함',
    '-111': '인증 번호가 틀림',
    '-102': '인증 가능한 기기 개수 초과',
    '-101': '다른 클라이언트가 로그인 중',
    '-100': '등록되지 않은 디바이스',
    '-1': '올바르지 않은 사용자',
    '30': '일부 필드 값이 잘못됨',
    '32': '카카오톡 계정을 찾을 수 없음',
    '500': 'Internal Error',
};

export default {
    errorReason,
};
